EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/i2c.c
/**
  ******************************************************************************
  * @file    i2c.c
  * @author  Artem Pisarenko, PMR dept. software team, ONIIP, PJSC
  * @date    24.11.2015
  * @brief   Реализация аппаратной абстракции доступа к I2C на STM32F2xx
  *
  * Notes:
  * - Don't set NOSTRETCH bit in slave transmit mode (workaround p2.3.4 of Errata sheet Rev 5).
  * - I2C bus must be enabled on persistent basis (rather than for master transfer duration only),
  *   because there are no way to get "STOP finished"/"bus not busy" event required to disable bus properly.
  * - After stopping master transfer, a dummy START-STOP transaction executed to workaround
  *   "shitty" STM32F2 I2C peripheral limitation (there are no "STOP finished"/"bus not busy" event)
  * - It's possible that in case of single byte reception, two bytes will be received,
  *   in case when software is running not fast enough comparable to bus communication speed,
  *   because of I2C hardware implementation (say thanks to STMicroelectronics !)
  * - Enabling/disabling smbus host may execute dummy START-STOP transaction, because it's the only way
  *   to set/clear ACK bit while peripheral enabled avoiding racing with possible addressing from
  *   other master on the bus (when ADDR is set but we don't know whether peripheral acknowledged it).
  *
  ******************************************************************************
  */

#include "stm32f2xx.h"
#include "FreeRTOS.h"

#include "sys_internal.h"
#include "hal_i2c.h"

#define I2C_MASTER_SPEED_CLOCK	88000 // using 88kHz clock to workaround p2.3.3 of Errata sheet Rev 5
#define I2C_INSTANCES_COUNT 3
#define I2C_SR1_BUS_ERROR_FLAGS	(I2C_SR1_BERR | I2C_SR1_ARLO | I2C_SR1_TIMEOUT)

#define DEFINE_PCB_FROM_HANDLE(var_pcb, handle) \
	struct s_i2cbus_pcb *var_pcb = (struct s_i2cbus_pcb *)handle; \
	SYS_ASSERT(var_pcb != 0);

typedef enum {
	stateIdle,
	stateStartingMaster,
	stateMasterAddressing,
	stateMasterRxSingleByte,
	stateMasterRxFirstN2Bytes,
	stateMasterRxLast2Bytes,
	stateMasterTxData,
	stateMasterTxPEC,
	stateMasterTxStopping,
	stateMasterFinishing,
	stateSlaveTx,
	stateSlaveRxSMBusHostAddress,
	stateSlaveRxSMBusHostDataLow,
	stateSlaveRxSMBusHostDataHigh,
	stateSlaveStopping
} i2c_state_t;

static struct s_i2cbus_pcb {
	I2C_TypeDef* i2c;
	IRQn_Type ev_irq_n;
	IRQn_Type er_irq_n;
	uint32_t rcc_apb_mask;
	hal_i2c_mode_t mode;
	i2c_state_t state;
	bool smbus_host_enabled;
	hal_i2c_smbus_host_params_t smbus_host_params;
	struct hal_i2c_master_transfer_t *master_transfer_queue_top;
	struct hal_i2c_master_transfer_t *master_transfer_queue_bottom;
	struct hal_i2c_master_transfer_t *active_mt;
	hal_i2c_transfer_result_t active_mt_result;
	int active_mt_pos;
	uint8_t active_mt_pec;
	struct hal_i2c_master_transfer_t *aborted_mt;
	i2c_state_t last_state; // used in slave mode communications
	bool smbushost_transfer_ready;
	uint8_t smbushost_address;
	uint16_t smbushost_status;
} i2cbus_pcbs[I2C_INSTANCES_COUNT] = {
	{I2C1, I2C1_EV_IRQn, I2C1_ER_IRQn, RCC_APB1ENR_I2C1EN, hi2cModeOff, stateIdle, false, {0, 0}, 0, 0, 0, hi2cSuccess, 0, 0, 0, stateIdle, false, 0, 0},
	{I2C2, I2C2_EV_IRQn, I2C2_ER_IRQn, RCC_APB1ENR_I2C2EN, hi2cModeOff, stateIdle, false, {0, 0}, 0, 0, 0, hi2cSuccess, 0, 0, 0, stateIdle, false, 0, 0},
	{I2C3, I2C3_EV_IRQn, I2C3_ER_IRQn, RCC_APB1ENR_I2C3EN, hi2cModeOff, stateIdle, false, {0, 0}, 0, 0, 0, hi2cSuccess, 0, 0, 0, stateIdle, false, 0, 0}
};

static uint8_t i2c_pec_precalc_table[256];

static void i2c_push_to_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t);
static struct hal_i2c_master_transfer_t* i2c_pop_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus);
static bool i2c_master_transfer_queue_is_empty(struct s_i2cbus_pcb *i2cbus);
static void i2c_remove_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t);
static inline void i2c_set_irq_pending(struct s_i2cbus_pcb *i2cbus);
static inline void i2c_request_start_condition(struct s_i2cbus_pcb *i2cbus);
static inline void i2c_request_stop_condition(struct s_i2cbus_pcb *i2cbus);
static void i2c_reset_master_mode(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR2);
static void i2c_stop_master_transfer(struct s_i2cbus_pcb *i2cbus);
static void i2c_abort_master_transfer(struct s_i2cbus_pcb *i2cbus);
static void i2c_close_active_master_transfer(struct s_i2cbus_pcb *i2cbus, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static bool i2c_process_master_rx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static bool i2c_process_master_tx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static void i2c_receive_master_data_byte(struct s_i2cbus_pcb *i2cbus);
static void i2c_transmit_master_data_byte(struct s_i2cbus_pcb *i2cbus);
static void i2c_process_slave_mode_change(struct s_i2cbus_pcb *i2cbus);
static int i2c_get_master_max_bytes_to_receive(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR2);
static inline uint8_t i2c_calc_pec(uint8_t pec, uint8_t data);
static void i2c_irq_handler(struct s_i2cbus_pcb *i2cbus);
static void i2c_irq_handler_master(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, uint16_t i2c_SR2, signed portBASE_TYPE *pxHigherPriorityTaskWoken);
static void i2c_irq_handler_smbus_host(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, uint16_t i2c_SR2, signed portBASE_TYPE *pxHigherPriorityTaskWoken);

void halinternal_i2c_init(void) {
	for (int i = 0; i < sizeof(i2cbus_pcbs)/sizeof(i2cbus_pcbs[0]); i++) {
		halinternal_set_nvic_priority(i2cbus_pcbs[i].ev_irq_n);
		NVIC_EnableIRQ(i2cbus_pcbs[i].ev_irq_n);
		halinternal_set_nvic_priority(i2cbus_pcbs[i].er_irq_n);
		NVIC_EnableIRQ(i2cbus_pcbs[i].er_irq_n);
	}
	for (uint32_t i = 0; i < sizeof(i2c_pec_precalc_table)/sizeof(i2c_pec_precalc_table[0]); i++) {
		uint32_t value = i;
		for (int j = 0; j < 8; j++)
			if (value & 0x80)
				value = (value << 1) ^ 0x07;
			else
				value <<= 1;
		i2c_pec_precalc_table[i] = value & 0xFF;
	}
}

