EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/i2c.c
void hal_i2c_set_bus_mode(int instance, hal_i2c_mode_t mode) {
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[instance-1]);
	SYS_ASSERT((1 <= instance) && (instance <= I2C_INSTANCES_COUNT));
	switch (mode) {
	case hi2cModeStandard:
	case hi2cModeSMBus: {
		uint32_t freqrange;
		halinternal_rcc_clocks_t rcc_clocks;
		uint32_t ccr_value;
		portDISABLE_INTERRUPTS();
		SYS_ASSERT(i2cbus->mode == hi2cModeOff);
		i2cbus->mode = mode;
		RCC->APB1ENR |= (i2cbus->rcc_apb_mask);
		__DSB();
		i2cbus->i2c->CR1 |= I2C_CR1_SWRST;
		i2cbus->i2c->CR1 &= ~I2C_CR1_SWRST;
		halinternal_get_rcc_clocks(&rcc_clocks);
		freqrange = rcc_clocks.pclk1_frequency/1000000;
		i2cbus->i2c->CR2 |= freqrange & I2C_CR2_FREQ;
		i2cbus->i2c->CR2 |= (I2C_CR2_ITEVTEN | I2C_CR2_ITERREN);
		i2cbus->i2c->TRISE = (freqrange + 1) & I2C_TRISE_TRISE; // using standard speed mode
		ccr_value = rcc_clocks.pclk1_frequency/(I2C_MASTER_SPEED_CLOCK << 1);
		i2cbus->i2c->CCR = (((ccr_value & I2C_CCR_CCR) < 4)? 4 : (ccr_value)) & I2C_CCR_CCR; // using standard speed mode
		if (mode == hi2cModeSMBus)
			i2cbus->i2c->CR1 |= I2C_CR1_SMBUS;
		i2cbus->i2c->CR1 |= I2C_CR1_PE;
		portENABLE_INTERRUPTS();
		break;
	}
	case hi2cModeOff: {
		bool iterface_is_busy;
		portDISABLE_INTERRUPTS();
		SYS_ASSERT(i2cbus->mode != hi2cModeOff);
		i2cbus->mode = mode;
		if (i2cbus->active_mt == 0) { // no master transfer in progress ?
			i2c_reset_master_mode(i2cbus, i2cbus->i2c->SR2);
			i2cbus->state = stateIdle;
		} else {
			i2c_abort_master_transfer(i2cbus);
		}
		i2cbus->smbus_host_enabled = false;
		portENABLE_INTERRUPTS();
		do {
			portDISABLE_INTERRUPTS();
			iterface_is_busy = !((i2cbus->state == stateIdle) && ((i2cbus->i2c->SR2 & I2C_SR2_MSL) == 0));
			if (!iterface_is_busy) {
				i2cbus->i2c->CR1 = 0;
				__DSB();
				RCC->APB1ENR &= ~(i2cbus->rcc_apb_mask);
			}
			portENABLE_INTERRUPTS();
		} while (iterface_is_busy);
		break;
	}
	default: SYS_ASSERT(0);
	}
}

bool hal_i2c_start_master_transfer(struct hal_i2c_master_transfer_t *t) {
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[t->device.bus_instance-1]);
	SYS_ASSERT((1 <= t->device.bus_instance) && (t->device.bus_instance <= I2C_INSTANCES_COUNT));
	SYS_ASSERT((t->device.address & 0x7F) == 0);
	SYS_ASSERT(t->size >= 0);
	if (t->size > 0) {
		SYS_ASSERT(t->dirs);
		SYS_ASSERT(t->data);
	} else {
		SYS_ASSERT(t->use_pec == false);
	}
	SYS_ASSERT(t->isrcallbackTransferCompleted);
	bool success = false;
	portDISABLE_INTERRUPTS();
	if (i2cbus->mode != hi2cModeOff) {
		i2c_push_to_master_transfer_queue(i2cbus, t);
		if (i2cbus->state == stateIdle)
			i2c_set_irq_pending(i2cbus);
		success = true;
	}
	portENABLE_INTERRUPTS();
	return success;
}

bool hal_i2c_abort_master_transfer(struct hal_i2c_master_transfer_t *t) {
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[t->device.bus_instance-1]);
	SYS_ASSERT((1 <= t->device.bus_instance) && (t->device.bus_instance <= I2C_INSTANCES_COUNT));
	bool success = false;
	portDISABLE_INTERRUPTS();
	if (i2cbus->mode != hi2cModeOff) {
		if (t == i2cbus->active_mt) { // is it in progress ?
			i2c_abort_master_transfer(i2cbus);
			success = true;
		} else { // it's expected to be still queued
			if (!i2c_master_transfer_queue_is_empty(i2cbus)) { // checks case when it removed from top of queue just few moments ago
				i2c_remove_from_master_transfer_queue(i2cbus, t);
				SYS_ASSERT(i2cbus->aborted_mt == 0);
				i2cbus->aborted_mt = t;
				i2c_set_irq_pending(i2cbus);
				success = true;
			}
		}
	}
	portENABLE_INTERRUPTS();
	return success;
}

hal_i2c_smbus_handle_t hal_i2c_open_smbus_host(int bus_instance, hal_i2c_smbus_host_params_t *params) {
	struct s_i2cbus_pcb *i2cbus = &(i2cbus_pcbs[bus_instance-1]);
	SYS_ASSERT((1 <= bus_instance) && (bus_instance <= I2C_INSTANCES_COUNT));
	SYS_ASSERT(params->isrcallbackMessageReceived);
	bool success = false;
	portDISABLE_INTERRUPTS();
	if ((i2cbus->mode == hi2cModeSMBus) && (i2cbus->smbus_host_enabled == false)) {
		i2cbus->smbus_host_enabled = true;
		i2cbus->smbus_host_params = *params;
		i2c_process_slave_mode_change(i2cbus);
		success = true;
	}
	portENABLE_INTERRUPTS();
	if (!success)
		i2cbus = 0;
	return (hal_i2c_smbus_handle_t)i2cbus;
}

void hal_i2c_close_smbus_host(hal_i2c_smbus_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(i2cbus, handle)
	portDISABLE_INTERRUPTS();
	if (i2cbus->smbus_host_enabled == true) {
		i2cbus->smbus_host_enabled = false;
		i2cbus->smbus_host_params.userid = 0;
		i2cbus->smbus_host_params.isrcallbackMessageReceived = 0;
		i2c_process_slave_mode_change(i2cbus);
	}
	portENABLE_INTERRUPTS();
}

void* hal_i2c_get_smbus_userid(hal_i2c_smbus_handle_t handle) {
	DEFINE_PCB_FROM_HANDLE(i2cbus, handle)
	return i2cbus->smbus_host_params.userid;
}

static void i2c_push_to_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t) {
	t->previous = 0;
	t->next = 0;
	if (i2cbus->master_transfer_queue_bottom) {
		SYS_ASSERT(i2cbus->master_transfer_queue_top != 0);
		t->previous = i2cbus->master_transfer_queue_bottom;
		i2cbus->master_transfer_queue_bottom = t;
	} else {
		SYS_ASSERT(i2cbus->master_transfer_queue_top == 0);
		i2cbus->master_transfer_queue_bottom = t;
		i2cbus->master_transfer_queue_top = i2cbus->master_transfer_queue_bottom;
	}
}

static struct hal_i2c_master_transfer_t* i2c_pop_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus) {
	struct hal_i2c_master_transfer_t *next = i2cbus->master_transfer_queue_top;
	if (next)
		i2c_remove_from_master_transfer_queue(i2cbus, next);
	return next;
}

static bool i2c_master_transfer_queue_is_empty(struct s_i2cbus_pcb *i2cbus) {
	return (i2cbus->master_transfer_queue_top == 0);
}

static void i2c_remove_from_master_transfer_queue(struct s_i2cbus_pcb *i2cbus, struct hal_i2c_master_transfer_t *t) {
	if (t->previous) {
		SYS_ASSERT(i2cbus->master_transfer_queue_top != 0);
		t->previous->next = t->next;
		t->previous = 0;
	} else {
		SYS_ASSERT(i2cbus->master_transfer_queue_top == t);
		i2cbus->master_transfer_queue_top = t->next;
	}
	if (t->next) {
		SYS_ASSERT(i2cbus->master_transfer_queue_bottom != 0);
		t->next->previous = t->previous;
		t->next = 0;
	} else {
		SYS_ASSERT(i2cbus->master_transfer_queue_bottom == t);
		i2cbus->master_transfer_queue_bottom = t->previous;
	}
}

