EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/i2c.c
static inline void i2c_set_irq_pending(struct s_i2cbus_pcb *i2cbus) {
	NVIC_SetPendingIRQ(i2cbus->ev_irq_n);
}

static inline void i2c_request_start_condition(struct s_i2cbus_pcb *i2cbus) {
	i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise RXNE,TXE flags (if set) will hold interrupt pending
	// set START + prevent setting STOP and/or PEC requests
	i2cbus->i2c->CR1 = (i2cbus->i2c->CR1 & ~(I2C_CR1_STOP | I2C_CR1_PEC)) | I2C_CR1_START;
}

static inline void i2c_request_stop_condition(struct s_i2cbus_pcb *i2cbus) {
	uint32_t smbhost_bits = 0;
	/* Here is the only safe place to change ACK bit for slave mode (see design note in source header) */
	if (((i2cbus->mode != hi2cModeOff)) && i2cbus->smbus_host_enabled)
		smbhost_bits = I2C_CR1_ACK | I2C_CR1_SMBTYPE | I2C_CR1_ENARP;
	// set STOP + optionally change smbhost bits + prevent setting START and/or PEC requests + clear POS and ENPEC bits
	i2cbus->i2c->CR1 = (i2cbus->i2c->CR1 & ~(I2C_CR1_START | I2C_CR1_PEC | I2C_CR1_POS | I2C_CR1_ENPEC)) | I2C_CR1_STOP | smbhost_bits;
}

static void i2c_reset_master_mode(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR2) {
	if ((i2c_SR2 & I2C_SR2_MSL) == 0)
		return;
	i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN;
	/* Following operations must be executed exactly in specified sequence in order to:
	 * - avoid resetting/breaking/missing slave communication which may happen after STOP in multi-master bus;
	 * - minimize undesirable operations (such as addressing).
	 */
	i2cbus->i2c->CR1 &= ~((I2C_CR1_ACK | I2C_CR1_POS) | I2C_CR1_START | I2C_CR1_STOP | I2C_CR1_PEC); // clear ACK and POS
	(void)i2cbus->i2c->SR1; // dummy read to reset SB(1st) and ADDR(1st)
	(void)i2cbus->i2c->SR2; // dummy read to reset ADDR(2nd), this may launch receiving, but it's impossible to avoid (just believe me)
	i2c_request_stop_condition(i2cbus);
	i2cbus->i2c->DR = 0; // dummy write to reset SB(2nd) and BTF, also it's safe to do after entering slave mode, because DR access ignored until ADDR cleared
}

static void i2c_stop_master_transfer(struct s_i2cbus_pcb *i2cbus) {
	i2c_request_stop_condition(i2cbus);
	i2c_request_start_condition(i2cbus);
	i2cbus->state = stateMasterFinishing;
}

static void i2c_abort_master_transfer(struct s_i2cbus_pcb *i2cbus) {
	SYS_ASSERT((i2cbus->active_mt != 0) && (i2cbus->aborted_mt == 0));
	i2cbus->aborted_mt = i2cbus->active_mt;
	if ((i2cbus->state == stateMasterFinishing)
			|| ((i2cbus->state == stateMasterRxSingleByte) && ((i2cbus->active_mt_pos + 1) == i2cbus->active_mt->size))) {
		i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN;
		/* For stateMasterFinishing case:
		 * START requested and interface will enter master mode. No worry - it will be handled in idle state.
		 */
	} else {
		i2c_reset_master_mode(i2cbus, i2cbus->i2c->SR2);
	}
	i2cbus->state = stateIdle;
	i2cbus->active_mt = 0;
	i2c_set_irq_pending(i2cbus);
}

static void i2c_close_active_master_transfer(struct s_i2cbus_pcb *i2cbus, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	struct hal_i2c_master_transfer_t *t = i2cbus->active_mt;
	i2cbus->active_mt = 0;
	t->isrcallbackTransferCompleted(t, i2cbus->active_mt_result, pxHigherPriorityTaskWoken);
}

static bool i2c_process_master_rx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) == 0) // don't handle AF (it cannot occur in master rx states)
		return false;
	i2cbus->i2c->SR1 = ~I2C_SR1_BUS_ERROR_FLAGS;
	i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN;
	(void)i2cbus->i2c->DR; // dummy read to clear RxNE flag
	i2cbus->active_mt_result = hi2cErrorBus;
	switch (i2cbus->state) {
	case stateMasterRxSingleByte:
		/* START/STOP already generated in addressing state or by peripheral.
		 * If addressing state generated (Repeated) START request, it's not clear whether peripheral cancels it or not.
		 * It's safer to close transfer here and fall-back to idle state.
		 * If peripheral didn't canceled START and will enter in master mode, it will handled in idle state (just in case).
		 */
		i2cbus->state = stateIdle;
		i2c_close_active_master_transfer(i2cbus, pxHigherPriorityTaskWoken);
		break;
	case stateMasterRxFirstN2Bytes:
	case stateMasterRxLast2Bytes:
		if ((i2c_SR1 & (I2C_SR1_BERR)) != 0) { // we should stop transfer ourselves ?..
			i2c_stop_master_transfer(i2cbus);
		} else { // ... or peripheral already did it ?
			i2c_request_start_condition(i2cbus); // just to properly set smbhost bits on stopping (see design notes in source header)
			i2cbus->state = stateMasterFinishing;
		}
		break;
	default: SYS_ASSERT(0);
	}
	return true;
}

static bool i2c_process_master_tx_error_condition(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) == 0)
		return false;
	i2cbus->i2c->SR1 = ~(I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS);
	i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN;
	if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0)
		i2cbus->active_mt_result = hi2cErrorBus;
	else
		i2cbus->active_mt_result = hi2cErrorDataNACK;
	switch (i2cbus->state) {
	case stateMasterTxData:
	case stateMasterTxPEC:
	case stateMasterTxStopping:
		if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BERR)) != 0) { // we should stop transfer ourselves ?..
			i2c_stop_master_transfer(i2cbus);
		} else { // ... or peripheral already did it ?
			i2c_request_start_condition(i2cbus); // just to properly set smbhost bits on stopping (see design notes in source header)
			i2cbus->state = stateMasterFinishing;
		}
		break;
	default: SYS_ASSERT(0);
	}
	return true;
}

static void i2c_receive_master_data_byte(struct s_i2cbus_pcb *i2cbus) {
	uint8_t byte = i2cbus->i2c->DR;
	i2cbus->active_mt_pec = i2c_calc_pec(i2cbus->active_mt_pec, byte);
	i2cbus->active_mt->data[i2cbus->active_mt_pos++] = byte;
}

static void i2c_transmit_master_data_byte(struct s_i2cbus_pcb *i2cbus) {
	uint8_t byte = i2cbus->active_mt->data[i2cbus->active_mt_pos++];
	i2cbus->active_mt_pec = i2c_calc_pec(i2cbus->active_mt_pec, byte);
	i2cbus->i2c->DR = byte;
}

