EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/i2c.c
static void i2c_process_slave_mode_change(struct s_i2cbus_pcb *i2cbus) {
	if ((i2cbus->active_mt == 0) && (i2cbus->state != stateStartingMaster)) { // no master transaction in progress ?
		/* Request master transaction (empty) */
		i2c_request_start_condition(i2cbus);
	}
	/* After requested (or current) master transaction finished, change will take effect. */
}

static bool i2c_process_slave_rx_conditions(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1) {
	if ((i2c_SR1 & I2C_SR1_RXNE) == 0) {
		if ((i2c_SR1 & (I2C_SR1_STOPF | I2C_SR1_BUS_ERROR_FLAGS)) != 0)
			i2cbus->state = stateSlaveStopping;
		return false;
	}
	return true;
}

/* Function returns MAXIMUM raw bytes count scheduled for reception from current buffer position, but not actual count.
 * It looks for closest direction change within (pos, pos+2] buffer range (assuming buffer[pos] at rx direction).
 * Function used in master transfer sequences for N>=2 reception (see STM32F2 reference manual).
 */
static int i2c_get_master_max_bytes_to_receive(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR2) {
	int bytes = i2cbus->active_mt->size - i2cbus->active_mt_pos + i2cbus->active_mt->use_pec;
	int offset = min(2, bytes - 1 - i2cbus->active_mt->use_pec);
	while (offset > 0) {
		if (i2cbus->active_mt->dirs[i2cbus->active_mt_pos + offset] != hi2cDirectionRx)
			bytes = offset;
		offset--;
	}
	return bytes;
}

static inline uint8_t i2c_calc_pec(uint8_t pec, uint8_t data) {
	return i2c_pec_precalc_table[(pec ^ data) & 0xFF];
}

static void i2c_irq_handler(struct s_i2cbus_pcb *i2cbus) {
	portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;
	if (i2cbus->aborted_mt != 0) {
		i2cbus->active_mt_result = hi2cErrorAborted;
		i2c_close_active_master_transfer(i2cbus, &xHigherPriorityTaskWoken);
	}
	if ((i2cbus->i2c->CR1 & I2C_CR1_PE) != 0) {
		/* I2C status registers must be read once and exactly in specified sequence in order to:
		 * - prevent loss of pending flags;
		 * - prevent loss of events occurred while irq handler is active.
		 */
		uint16_t i2c_SR2 = i2cbus->i2c->SR2;
		uint16_t i2c_SR1 = i2cbus->i2c->SR1;
		/* Process unsupported/unexpected error conditions */
		if ((i2c_SR1 & (I2C_SR1_SMBALERT | I2C_SR1_PECERR | I2C_SR1_OVR)) != 0) {
			/* Something wrong, because:
			 * - SMBus alert feature isn't enabled;
			 * - PEC isn't used (PECEN=0) in any transfer;
			 * - clock stretching isn't disabled (NOSTRETCH=0).
			 */
			SYS_ASSERT(0);
			i2cbus->i2c->SR1 = ~(I2C_SR1_SMBALERT | I2C_SR1_PECERR | I2C_SR1_OVR);
		}
		/* Slave and master handlers must be run exactly in specified sequence in order to
		 * prevent stuck with non-handled pending flags kept from some communication scenarios.
		 * Example:
		 * - application requested master transfer (requested START, entered stateStartingMaster);
		 * - some master on bus executed empty "address-only" communication, which caused ADDR and STOPF flags being set;
		 * - requested START completed;
		 * - if master handler will detect SB first, it proceeds and change state to "master-only" state,
		 *   after that, slave handler will not clear STOPF.
		 * In other words, we should consider slave events as more prioritized over master events
		 * due to uncontrolled transitions in slave mode communication.
		 */
		i2c_irq_handler_smbus_host(i2cbus, i2c_SR1, i2c_SR2, &xHigherPriorityTaskWoken);
		i2c_irq_handler_master(i2cbus, i2c_SR1, i2c_SR2, &xHigherPriorityTaskWoken);
	}
	portEND_SWITCHING_ISR(xHigherPriorityTaskWoken);
}

static void i2c_irq_handler_master(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, uint16_t i2c_SR2, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	switch (i2cbus->state) {
	case stateMasterFinishing: { // must be placed before stateIdle and fall-through to it in order to request STOP (if required)
		if ((i2c_SR1 & I2C_SR1_TIMEOUT) == 0) { // don't handle BERR, AF and ARLO (they cannot occur in this state)
			if ((i2c_SR1 & I2C_SR1_SB) == 0)
				break;
		} else {
			i2cbus->i2c->SR1 = ~I2C_SR1_TIMEOUT;
			i2cbus->active_mt_result = hi2cErrorBus;
		}
		i2cbus->state = stateIdle;
		i2c_close_active_master_transfer(i2cbus, pxHigherPriorityTaskWoken);
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct fall-through (synchronized with read sequence in i2c_irq_handler())
	}
	/* no break */
	case stateIdle: { // this state is universal entry for processing pending (queued) transfers: either start next one or drop all of them
		if ((i2c_SR2 & I2C_SR2_MSL) != 0) { // required after stateMasterFinishing and some special cases when START request leaved pending (such as aborted transfers)
			(void)i2cbus->i2c->SR1; // dummy read to reset SB(1st)
			i2c_request_stop_condition(i2cbus);
			i2cbus->i2c->DR = 0; // dummy write to reset SB(2nd), also it's safe to do after entering slave mode, because DR access ignored until ADDR cleared
		}
		if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) != 0) {
			/* These flags may be kept from previous aborted transfer. Just reset and forget them. */
			i2cbus->i2c->SR1 = ~(I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS);
		}
		if (i2cbus->mode == hi2cModeOff) {
			/* Flush all pending master transfers as aborted and quit */
			struct hal_i2c_master_transfer_t *t;
			while ((bool)(t = i2c_pop_from_master_transfer_queue(i2cbus)))
				t->isrcallbackTransferCompleted(t, hi2cErrorAborted, pxHigherPriorityTaskWoken);
			break;
		}
		if (i2c_master_transfer_queue_is_empty(i2cbus))
			break;
		// we cannot fetch transfer item right now (before SB bit has been set) because of possible multi-master races, which could activate slave mode communication
		i2c_request_start_condition(i2cbus);
		i2cbus->state = stateStartingMaster;
		break;
	}
	case stateStartingMaster: { // this state also used for Repeated START and enabling/disabling smbus host
		// don't handle BERR, AF, ARLO, TIMEOUT because they cannot occur in this state
		if ((i2c_SR1 & I2C_SR1_SB) == 0)
			break;
		if (i2cbus->active_mt == 0) { // no master transfer in progress ?
			i2cbus->active_mt = i2c_pop_from_master_transfer_queue(i2cbus); // try(!) to fetch next master transfer
			if (i2cbus->active_mt == 0) {
				i2c_reset_master_mode(i2cbus, i2c_SR2);
				i2cbus->state = stateIdle;
				break;
			}
			i2cbus->active_mt_result = hi2cSuccess; // optimistic initialization (any error will overwrite it)
			i2cbus->active_mt_pos = 0;
			i2cbus->active_mt_pec = 0;
		}
		uint8_t address = (i2cbus->active_mt->device.address << 1); // transmitter mode selected
		// for zero-size transfer it's important to set transmitter mode
		if ((i2cbus->active_mt->size > 0)
				&& (i2cbus->active_mt_pos < i2cbus->active_mt->size)
				&& (i2cbus->active_mt->dirs[i2cbus->active_mt_pos] == hi2cDirectionRx))
			address |= 0x01; // selects receiver mode
		i2cbus->i2c->CR1 &= ~(I2C_CR1_ACK | I2C_CR1_POS | I2C_CR1_ENPEC);
		i2cbus->i2c->DR = address; // also clears RxNE flag from previous transfer
		i2cbus->state = stateMasterAddressing;
		i2cbus->active_mt_pec = i2c_calc_pec(i2cbus->active_mt_pec, address);
		break;
	}
	case stateMasterAddressing: {
		if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS)) != 0) {
			(void)i2cbus->i2c->SR2; // dummy read to clear ADDR (properly synchronized with read sequence in i2c_irq_handler())
			i2cbus->i2c->SR1 = ~(I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS);
			if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0)
				i2cbus->active_mt_result = hi2cErrorBus;
			else
				i2cbus->active_mt_result = hi2cErrorAddressNACK;
			if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BERR)) != 0) { // we should stop transfer ourselves ?..
				i2c_stop_master_transfer(i2cbus);
			} else { // ... or peripheral already did it ?
				i2c_request_start_condition(i2cbus); // just to properly set smbhost bits on stopping (see design notes in source header)
				i2cbus->state = stateMasterFinishing;
			}
			break;
		}
		if ((i2c_SR1 & I2C_SR1_ADDR) == 0)
			break;
		if (i2cbus->active_mt->size > 0) {
			int max_bytes_to_receive = 0;
			if ((i2c_SR2 & I2C_SR2_TRA) == 0) { // receiver mode ?
				max_bytes_to_receive = i2c_get_master_max_bytes_to_receive(i2cbus, i2c_SR2);
				if (max_bytes_to_receive > 1)
					i2cbus->i2c->CR1 |= I2C_CR1_ACK;
				if (max_bytes_to_receive == 2)
					i2cbus->i2c->CR1 |= I2C_CR1_POS;
			}
			i2cbus->i2c->CR2 |= I2C_CR2_ITBUFEN;
			__disable_irq(); // trying to workaround "single byte reception" (reducing time between clearing ADDR bit and setting START/STOP bit)
			(void)i2cbus->i2c->SR2; // dummy read to clear ADDR (properly synchronized with read sequence in i2c_irq_handler())
			if ((i2c_SR2 & I2C_SR2_TRA) == 0) { // receiver mode ?
				if (max_bytes_to_receive == 1) {
					if ((i2cbus->active_mt_pos + 1) < i2cbus->active_mt->size) { // not last byte in transfer ?
						i2cbus->i2c->CR1 |= I2C_CR1_START; // Repeated START (we cannot use i2c_request_start_condition() because it disables ITBUFEN)
					} else { // last byte in transfer ?
						i2c_request_stop_condition(i2cbus); // STOP
					}
					i2cbus->state = stateMasterRxSingleByte;
				} else {
					i2cbus->state = stateMasterRxFirstN2Bytes;
				}
			} else { // transmitter mode ?
				i2cbus->state = stateMasterTxData;
			}
			__enable_irq();
		} else {
			// dummy read to clear ADDR (properly synchronized with read sequence in i2c_irq_handler()), transmitter mode ensures no transfer will be started
			(void)i2cbus->i2c->SR2;
			i2c_stop_master_transfer(i2cbus);
		}
		break;
	}
	case stateMasterRxSingleByte: {
		if (i2c_process_master_rx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_RXNE) == 0)
			break;
		if ((i2cbus->active_mt_pos + 1) < i2cbus->active_mt->size) { // not last byte in transfer ?
			// already requested START in stateMasterAddressing
			i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN;
			i2cbus->state = stateStartingMaster;
		} else { // last byte in transfer ?
			// already requested STOP in stateMasterAddressing
			i2c_request_start_condition(i2cbus);
			i2cbus->state = stateMasterFinishing;
		}
		/* received byte is data byte (single byte transfers cannot contain PEC) */
		i2c_receive_master_data_byte(i2cbus);
		break;
	}
	case stateMasterRxFirstN2Bytes: {
		if (i2c_process_master_rx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_RXNE) == 0)
			break;
		int max_bytes_to_receive = i2c_get_master_max_bytes_to_receive(i2cbus, i2c_SR2);
		if ((max_bytes_to_receive == 2) || (max_bytes_to_receive == 3)) {
			i2cbus->i2c->CR1 &= ~I2C_CR1_ACK; // must be disabled before N-2 byte read
			i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise RxNE flag will hold interrupt pending
		}
		if (max_bytes_to_receive > 2) {
			/* received byte is data byte (first N-2 bytes cannot contain PEC) */
			i2c_receive_master_data_byte(i2cbus);
			break;
		}
		i2cbus->state = stateMasterRxLast2Bytes;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct fall-through (synchronized with read sequence in i2c_irq_handler())
	}
	/* no break */
	case stateMasterRxLast2Bytes: {
		if (i2c_process_master_rx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_BTF) == 0)
			break;
		if ((i2cbus->active_mt_pos + 2) < i2cbus->active_mt->size) { // not last bytes in total transfer ?
			i2c_request_start_condition(i2cbus); // Repeated START
			i2cbus->state = stateStartingMaster;
		} else { // last bytes in total transfer ?
			i2c_stop_master_transfer(i2cbus); // STOP
		}
		for (int i = 0; i < 2; i++) {
			if (!((i == 1) && i2cbus->active_mt->use_pec)) {
				i2c_receive_master_data_byte(i2cbus);
			} else {
				uint8_t pec = i2cbus->i2c->DR;
				if (pec != i2cbus->active_mt_pec)
					i2cbus->active_mt_result = hi2cErrorPEC;
			}
		}
		break;
	}
	case stateMasterTxData: {
		if (i2c_process_master_tx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_TXE) == 0)
			break;
		i2c_transmit_master_data_byte(i2cbus);
		if (i2cbus->active_mt_pos < i2cbus->active_mt->size) {
			// transfer direction changed ?
			if (((i2c_SR2 & I2C_SR2_TRA) >> POSITION_VAL(I2C_SR2_TRA)) != i2cbus->active_mt->dirs[i2cbus->active_mt_pos]) {
				i2c_request_start_condition(i2cbus); // Repeated START
				i2cbus->state = stateStartingMaster;
			}
		} else {
			if (!i2cbus->active_mt->use_pec) {
				i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise TXE flag will hold interrupt pending
				i2cbus->state = stateMasterTxStopping;
			} else {
				i2cbus->state = stateMasterTxPEC;
			}
		}
		break;
	}
	case stateMasterTxPEC: {
		if (i2c_process_master_tx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_TXE) == 0)
			break;
		i2cbus->i2c->DR = i2cbus->active_mt_pec;
		i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise TXE flag will hold interrupt pending
		i2cbus->state = stateMasterTxStopping;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct fall-through (synchronized with read sequence in i2c_irq_handler())
	}
	/* no break */
	case stateMasterTxStopping: {
		if (i2c_process_master_tx_error_condition(i2cbus, i2c_SR1, pxHigherPriorityTaskWoken))
			break;
		if ((i2c_SR1 & I2C_SR1_BTF) == 0)
			break;
		i2c_stop_master_transfer(i2cbus);
		break;
	}
	default:
		break;
	}
}

