EgorNezox/Lol/system/platform/stm32f2-common/system_hardware/i2c.c
static void i2c_irq_handler_smbus_host(struct s_i2cbus_pcb *i2cbus, uint16_t i2c_SR1, uint16_t i2c_SR2, signed portBASE_TYPE *pxHigherPriorityTaskWoken) {
	switch (i2cbus->state) {
	case stateIdle:
	case stateStartingMaster: { // we handling master state here because of possible multi-master races
		// possible I2C_SR1_BUS_ERROR_FLAGS are handled in master handler
		if ((i2c_SR1 & I2C_SR1_ADDR) == 0)
			break;
		(void)i2cbus->i2c->SR2; // dummy read to clear ADDR (properly synchronized with read sequence in i2c_irq_handler())
		if ((i2cbus->i2c->SR1 & I2C_SR1_STOPF) != 0) { // important check for STOPF must be done right here (also reading SR1 starts clearing flag)
			// dummy write to complete clearing STOPF (synchronized with read sequence in i2c_irq_handler()), also prevents setting START, STOP, PEC requests
			i2cbus->i2c->CR1 = i2cbus->i2c->CR1 & ~(I2C_CR1_START | I2C_CR1_STOP | I2C_CR1_PEC);
			break; // just stay at same state (it was empty "address-only" communication)
		}
		if ((i2cbus->i2c->CR1 & I2C_CR1_ACK) == 0) { // proper way to determine peripheral state (don't use smbus_host_enabled value)
			/* We are still getting ADDR requests from other masters on bus, because peripheral is always enabled (even with ACK cleared). */
			break;
		}
		i2cbus->last_state = i2cbus->state; // after transfer completion we should return to either stateIdle or stateStartingMaster
		i2cbus->smbushost_transfer_ready = false;
		i2cbus->i2c->CR2 |= I2C_CR2_ITBUFEN;
		if ((i2c_SR2 & I2C_SR2_TRA) == 0) {
			SYS_ASSERT((i2c_SR2 & I2C_SR2_SMBHOST) != 0);
			i2cbus->state = stateSlaveRxSMBusHostAddress;
		} else {
			/* We don't support slave transmitter mode, but there are no way to abort it. */
			i2cbus->state = stateSlaveTx;
		}
		break;
	}
	case stateSlaveTx: {
		/* We don't support slave transmitter mode, so we just feeding master until it stop transfer (or error occur) */
		if ((i2c_SR1 & (I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS | I2C_SR1_STOPF)) != 0) {
			i2cbus->i2c->SR1 = ~(I2C_SR1_AF | I2C_SR1_BUS_ERROR_FLAGS);
			i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN; // otherwise TXE flag will hold interrupt pending
			i2cbus->state = stateSlaveStopping;
		} else if ((i2c_SR1 & I2C_SR1_TXE) != 0) {
			i2cbus->i2c->DR = 0xFF; // also clears TXE, BTF flags
		}
		break;
	}
	case stateSlaveRxSMBusHostAddress: {
		if (!i2c_process_slave_rx_conditions(i2cbus, i2c_SR1))
			break;
		i2cbus->smbushost_address = i2cbus->i2c->DR;
		i2cbus->state = stateSlaveRxSMBusHostDataLow;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct RXNE/STOPF fall-through (synchronized with read sequence in i2c_irq_handler())
	}
	/* no break */
	case stateSlaveRxSMBusHostDataLow: {
		if (!i2c_process_slave_rx_conditions(i2cbus, i2c_SR1))
			break;
		i2cbus->smbushost_status = i2cbus->i2c->DR & 0xFF;
		i2cbus->state = stateSlaveRxSMBusHostDataHigh;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct RXNE/STOPF fall-through (synchronized with read sequence in i2c_irq_handler())
	}
	/* no break */
	case stateSlaveRxSMBusHostDataHigh: {
		if (!i2c_process_slave_rx_conditions(i2cbus, i2c_SR1))
			break;
		i2cbus->smbushost_status |= (i2cbus->i2c->DR << 8) & 0xFF00;
		i2cbus->smbushost_transfer_ready = true;
		i2cbus->state = stateSlaveStopping;
		i2c_SR1 = i2cbus->i2c->SR1; // update for correct RXNE/STOPF fall-through (synchronized with read sequence in i2c_irq_handler())
	}
	/* no break */
	case stateSlaveStopping: {
		if ((i2c_SR1 & I2C_SR1_RXNE) != 0) {
			i2cbus->smbushost_transfer_ready = false; // invalidate transfer if any extra bytes was received
			(void)i2cbus->i2c->DR; // dummy read to reset RxNE (byte in data register)
			(void)i2cbus->i2c->DR; // dummy read to reset RxNE (in case when second byte waited in shift register)
		}
		if ((i2c_SR1 & (I2C_SR1_STOPF | I2C_SR1_BUS_ERROR_FLAGS)) == 0)
			break;
		// dummy write to complete clearing STOPF (synchronized with read sequence in i2c_irq_handler()), also prevents setting START, STOP, PEC requests
		i2cbus->i2c->CR1 = i2cbus->i2c->CR1 & ~(I2C_CR1_START | I2C_CR1_STOP | I2C_CR1_PEC);
		if ((i2c_SR1 & I2C_SR1_BUS_ERROR_FLAGS) != 0) {
			i2cbus->smbushost_transfer_ready = false; // invalidate transfer on any error
			i2cbus->i2c->SR1 = ~I2C_SR1_BUS_ERROR_FLAGS;
		}
		i2cbus->i2c->CR2 &= ~I2C_CR2_ITBUFEN;
		i2cbus->state = i2cbus->last_state;
		if (i2cbus->smbus_host_enabled && i2cbus->smbushost_transfer_ready)
			i2cbus->smbus_host_params.isrcallbackMessageReceived((hal_i2c_smbus_handle_t)i2cbus, i2cbus->smbushost_address, i2cbus->smbushost_status, pxHigherPriorityTaskWoken);
		break;
	}
	default:
		break;
	}
}

void I2C1_EV_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[0]);
}
void I2C2_EV_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[1]);
}
void I2C3_EV_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[3]);
}
void I2C1_ER_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[0]);
}
void I2C2_ER_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[1]);
}
void I2C3_ER_IRQHandler(void) {
	i2c_irq_handler(&i2cbus_pcbs[2]);
}
